# Доделать задание  с ромбом, чтобы вывод был:
"""
   *
  ***
 *****

   
0 - 1 звезда,2 пробела 
1 - 3 звезда,1 пробела
2 - 5 звезда,0 пробелов

(2*индекс_строки) + 1 = кол-во звёзд

0 - 1 звезда,2 пробела 
1 - 3 звезда,1 пробела
2 - 5 звезда,0 пробелов
высота - индекс_

(высота - индекс_строки) - 1 = кол-во пробелов


"""

h = int(input('введите число'))
for i in range(h):
    spaces = (h - i) - 1
    stars = (2 * i) + 1
    row = ' ' * spaces + '*' * stars
    print(row)
for i in range((h - 1) - 1, 0 - 1, -1):
    spaces = (h - i) - 1
    stars = (2 * i) + 1
    row = ' ' * spaces + '*' * stars
    print(row)

for i in range(3, 0 - 1, -1):
    print(i)

